; domain
(define (domain upp)
(:requirements :typing :probabilistic-effects)
(:types  size_t location_t side_t color_t image_t resource_t sheet_t)
(:constants
		Letter - size_t

		Black
		Color - color_t

		Front
		Back - side_t

		Some_Feeder_Tray
		Some_Finisher_Tray
		EndCap_Entry-BlackContainer_Exit
		HtmOverBlack_Entry-EndCap_Exit
		HtmOverBlack_Exit-Down_TopEntry
		ColorContainer_Entry-Down_BottomExit
		ColorContainer_ExitToIME-ColorPrinter_Entry
		ColorPrinter_Exit-ColorContainer_EntryFromIME
		ColorContainer_Exit-Up_BottomEntry
		Down_BottomEntry-ColorFeeder_Exit
		BlackContainer_Entry-BlackFeeder_Exit
		Down_TopExit-HtmOverColor_Entry
		HtmOverColor_Exit-Up_TopEntry
		BlackContainer_ExitToIME-BlackPrinter_Entry
		BlackPrinter_Exit-BlackContainer_EntryFromIME
		Finisher1_Entry-Up_TopExit
		Finisher2_Entry-Finisher1_Exit
		Finisher1_Tray
		Finisher2_Exit
		Finisher2_Tray - location_t

		EndCap-RSRC
		HtmOverBlack-RSRC
		ColorContainer-RSRC
		ColorPrinter-RSRC
		ColorFeeder-RSRC
		BlackFeeder-RSRC
		Down-RSRC
		HtmOverColor-RSRC
		BlackContainer-RSRC
		BlackPrinter-RSRC
		Up-RSRC
		Finisher1-RSRC
		Finisher2-RSRC - resource_t
)
(:predicates
		(Sheetsize ?sheet - sheet_t ?size - size_t)
		(Location ?sheet - sheet_t ?location - location_t)
		(Hasimage ?sheet - sheet_t ?side - side_t ?image - image_t)
		(Sideup ?sheet - sheet_t ?side - side_t)
		(Stackedin ?sheet - sheet_t ?location - location_t)
		(Imagecolor ?image - image_t ?color - color_t)
		(Notprintedwith ?sheet - sheet_t ?side - side_t ?color - color_t)
		(Oppositeside ?side1 - side_t ?side2 - side_t)
		(Available ?resource - resource_t)
		(Prevsheet ?sheet1 - sheet_t ?sheet2 - sheet_t)
		(Uninitialized)

)
;;(:functions (total-cost) - number)
(:action initialize
 :parameters ()
 :precondition (and
		(Uninitialized))
 :effect (and
		(not (Uninitialized))
		(Available EndCap-RSRC)
		(Available HtmOverBlack-RSRC)
		(Available ColorContainer-RSRC)
		(Available ColorPrinter-RSRC)
		(Available ColorFeeder-RSRC)
		(Available BlackFeeder-RSRC)
		(Available Down-RSRC)
		(Available HtmOverColor-RSRC)
		(Available BlackContainer-RSRC)
		(Available BlackPrinter-RSRC)
		(Available Up-RSRC)
		(Available Finisher1-RSRC)
		(Available Finisher2-RSRC))
)
(:action ColorContainer-ToIME-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available ColorContainer-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet ColorContainer_Entry-Down_BottomExit))
 :effect (and
		(Location ?sheet ColorContainer_ExitToIME-ColorPrinter_Entry)
		(not (Location ?sheet ColorContainer_Entry-Down_BottomExit))
		(Available ColorContainer-RSRC)
		(increase (total-cost) 7999))
)
(:action ColorContainer-FromIME-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available ColorContainer-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet ColorPrinter_Exit-ColorContainer_EntryFromIME))
 :effect (and
		(Location ?sheet ColorContainer_Exit-Up_BottomEntry)
		(not (Location ?sheet ColorPrinter_Exit-ColorContainer_EntryFromIME))
		(Available ColorContainer-RSRC)
		(increase (total-cost) 7999))
)
(:action ColorPrinter-Simplex-Letter
 :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t)
 :precondition (and
		(Available ColorPrinter-RSRC)
		(Sheetsize ?sheet Letter)
		(Sideup ?sheet ?face)
		(Imagecolor ?image Color)
		(Location ?sheet ColorContainer_ExitToIME-ColorPrinter_Entry)
		(Notprintedwith ?sheet ?face Color))
 :effect (and
		(Location ?sheet ColorPrinter_Exit-ColorContainer_EntryFromIME)
		(Hasimage ?sheet ?face ?image)
		(not (Location ?sheet ColorContainer_ExitToIME-ColorPrinter_Entry))
		(not (Notprintedwith ?sheet ?face Color))
		(Available ColorPrinter-RSRC)
		(increase (total-cost) 224039))
)
(:action ColorPrinter-SimplexMono-Letter
 :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t)
 :precondition (and
		(Available ColorPrinter-RSRC)
		(Sheetsize ?sheet Letter)
		(Sideup ?sheet ?face)
		(Imagecolor ?image Black)
		(Location ?sheet ColorContainer_ExitToIME-ColorPrinter_Entry)
		(Notprintedwith ?sheet ?face Black))
 :effect (and
		(Location ?sheet ColorPrinter_Exit-ColorContainer_EntryFromIME)
		(Hasimage ?sheet ?face ?image)
		(not (Location ?sheet ColorContainer_ExitToIME-ColorPrinter_Entry))
		(not (Notprintedwith ?sheet ?face Black))
		(Available ColorPrinter-RSRC)
		(increase (total-cost) 224039))
)
(:action Down-MoveTop-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Down-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet HtmOverBlack_Exit-Down_TopEntry))
 :effect (and
		(Location ?sheet Down_TopExit-HtmOverColor_Entry)
		(not (Location ?sheet HtmOverBlack_Exit-Down_TopEntry))
		(Available Down-RSRC)
		(increase (total-cost) 2998))
)
(:action Down-MoveBottom-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Down-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Down_BottomEntry-ColorFeeder_Exit))
 :effect (and
		(Location ?sheet ColorContainer_Entry-Down_BottomExit)
		(not (Location ?sheet Down_BottomEntry-ColorFeeder_Exit))
		(Available Down-RSRC)
		(increase (total-cost) 2998))
)
(:action Down-MoveDown-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Down-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet HtmOverBlack_Exit-Down_TopEntry))
 :effect (and
		(Location ?sheet ColorContainer_Entry-Down_BottomExit)
		(not (Location ?sheet HtmOverBlack_Exit-Down_TopEntry))
		(Available Down-RSRC)
		(increase (total-cost) 9998))
)
(:action BlackContainer-ToIME-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available BlackContainer-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet BlackContainer_Entry-BlackFeeder_Exit))
 :effect (and
 	  (Location ?sheet BlackContainer_ExitToIME-BlackPrinter_Entry)
	  (not (Location ?sheet BlackContainer_Entry-BlackFeeder_Exit))
	  (Available BlackContainer-RSRC)
	  (increase (total-cost) 1999))
)
(:action BlackContainer-FromIME-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available BlackContainer-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet BlackPrinter_Exit-BlackContainer_EntryFromIME))
 :effect (and
		(Location ?sheet EndCap_Entry-BlackContainer_Exit)
		(not (Location ?sheet BlackPrinter_Exit-BlackContainer_EntryFromIME))
		(Available BlackContainer-RSRC)
		(increase (total-cost) 1999))
)
(:action BlackPrinter-Simplex-Letter
 :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t)
 :precondition (and
		(Available BlackPrinter-RSRC)
		(Sheetsize ?sheet Letter)
		(Sideup ?sheet ?face)
		(Imagecolor ?image Black)
		(Location ?sheet BlackContainer_ExitToIME-BlackPrinter_Entry)
		(Notprintedwith ?sheet ?face Black))
 :effect (and
		(Location ?sheet BlackPrinter_Exit-BlackContainer_EntryFromIME)
		(Hasimage ?sheet ?face ?image)
		(not (Location ?sheet BlackContainer_ExitToIME-BlackPrinter_Entry))
		(not (Notprintedwith ?sheet ?face Black))
		(Available BlackPrinter-RSRC)
		(increase (total-cost) 113012))
)
(:action BlackPrinter-SimplexAndInvert-Letter
 :parameters ( ?sheet - sheet_t ?face - side_t ?otherface - side_t ?image - image_t)
 :precondition (and
		(Available BlackPrinter-RSRC)
		(Sheetsize ?sheet Letter)
		(Oppositeside ?face ?otherface)
		(Imagecolor ?image Black)
		(Location ?sheet BlackContainer_ExitToIME-BlackPrinter_Entry)
		(Notprintedwith ?sheet ?face Black)
		(Sideup ?sheet ?face))
 :effect (and
		(Location ?sheet BlackPrinter_Exit-BlackContainer_EntryFromIME)
		(Sideup ?sheet ?otherface)
		(Hasimage ?sheet ?face ?image)
		(not (Location ?sheet BlackContainer_ExitToIME-BlackPrinter_Entry))
		(not (Notprintedwith ?sheet ?face Black))
		(not (Sideup ?sheet ?face))
		(Available BlackPrinter-RSRC)
		(increase (total-cost) 123012))
)
(:action Up-MoveTop-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Up-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet HtmOverColor_Exit-Up_TopEntry))
 :effect (and
		(Location ?sheet Finisher1_Entry-Up_TopExit)
		(not (Location ?sheet HtmOverColor_Exit-Up_TopEntry))
		(Available Up-RSRC)
		(increase (total-cost) 2998))
)
(:action Up-MoveUp-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Up-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet ColorContainer_Exit-Up_BottomEntry))
 :effect (and
		(Location ?sheet Finisher1_Entry-Up_TopExit)
		(not (Location ?sheet ColorContainer_Exit-Up_BottomEntry))
		(Available Up-RSRC)
		(increase (total-cost) 9998))
)
(:action Finisher1-PassThrough-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Finisher1-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Finisher1_Entry-Up_TopExit))
 :effect (and
		(Location ?sheet Finisher2_Entry-Finisher1_Exit)
		(not (Location ?sheet Finisher1_Entry-Up_TopExit))
		(Available Finisher1-RSRC)
		(increase (total-cost) 7999))
)
(:action Finisher1-Stack-Letter
 :parameters ( ?sheet - sheet_t ?prevsheet - sheet_t)
 :precondition (and
		(Available Finisher1-RSRC)
		(Prevsheet ?sheet ?prevsheet)
		(Location ?prevsheet Some_Finisher_Tray)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Finisher1_Entry-Up_TopExit))
 :effect (and
		(Location ?sheet Some_Finisher_Tray)
		(Stackedin ?sheet Finisher1_Tray)
		(not (Location ?sheet Finisher1_Entry-Up_TopExit))
		(Available Finisher1-RSRC)
		
		(increase (total-cost) 7999))
)
(:action Finisher2-PassThrough-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available Finisher2-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Finisher2_Entry-Finisher1_Exit))
 :effect (and
		(Location ?sheet Finisher2_Exit)
		(not (Location ?sheet Finisher2_Entry-Finisher1_Exit))
		(Available Finisher2-RSRC)
		(increase (total-cost) 7999))
)
(:action EndCap-Move-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available EndCap-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet EndCap_Entry-BlackContainer_Exit))
 :effect (and   (probabilistic 
		 0.9
		    (and (Location ?sheet HtmOverBlack_Entry-EndCap_Exit)
			 (not (Location ?sheet EndCap_Entry-BlackContainer_Exit))
			 (Available EndCap-RSRC))
		 0.1
		    (and (not (Available EndCap-RSRC))
			
			 (not (Location ?sheet EndCap_Entry-BlackContainer_Exit))
			 (Location ?sheet Some_Feeder_Tray)
			 (forall (?side - side_t ?image - image_t) 
				 (not (Hasimage ?sheet ?side ?image)))
			 (forall (?side - side_t) (not (Sideup ?sheet ?side)))
			 (Notprintedwith ?sheet Front Black)
			 (Notprintedwith ?sheet Back Black)                    
			 (Notprintedwith ?sheet Front Color)
			 (Notprintedwith ?sheet Back Color)))
		(increase (total-cost) 1999))
)
(:action HtmOverBlack-Move-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available HtmOverBlack-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet HtmOverBlack_Entry-EndCap_Exit))
 :effect (and   (probabilistic 
		 0.9
		    (and (Location ?sheet HtmOverBlack_Exit-Down_TopEntry)
			 (not (Location ?sheet HtmOverBlack_Entry-EndCap_Exit))
			 (Available HtmOverBlack-RSRC))
		 0.1
		    (and (not (Available HtmOverBlack-RSRC))
			
			 (not (Location ?sheet HtmOverBlack_Entry-EndCap_Exit))
			 (Location ?sheet Some_Feeder_Tray)
			 (forall (?side - side_t ?image - image_t) 
				 (not (Hasimage ?sheet ?side ?image)))
			 (forall (?side - side_t) (not (Sideup ?sheet ?side)))
			 (Notprintedwith ?sheet Front Black)
			 (Notprintedwith ?sheet Back Black)                    
			 (Notprintedwith ?sheet Front Color)
			 (Notprintedwith ?sheet Back Color)))
		(increase (total-cost) 17998))
)
(:action BlackFeeder-Feed-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available BlackFeeder-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Some_Feeder_Tray))
 :effect (and
	        (probabilistic 
		 0.9
		    (and (Location ?sheet BlackContainer_Entry-BlackFeeder_Exit)
			 (Sideup ?sheet Front)
			 (not (Location ?sheet Some_Feeder_Tray))
			 (Available BlackFeeder-RSRC))
		 0.1
		   (and (not (Available BlackFeeder-RSRC))
			))
		(increase (total-cost) 7999))
)
(:action HtmOverColor-Move-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available HtmOverColor-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Down_TopExit-HtmOverColor_Entry))
 :effect (and
		(Location ?sheet HtmOverColor_Exit-Up_TopEntry)
		(not (Location ?sheet Down_TopExit-HtmOverColor_Entry))
		(Available HtmOverColor-RSRC)
		(increase (total-cost) 9998))
)
(:action Finisher2-Stack-Letter
 :parameters ( ?sheet - sheet_t ?prevsheet - sheet_t)
 :precondition (and
		(Available Finisher2-RSRC)
		(Prevsheet ?sheet ?prevsheet)
		(Location ?prevsheet Some_Finisher_Tray)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Finisher2_Entry-Finisher1_Exit))
 :effect (and
		(Location ?sheet Some_Finisher_Tray)
; I changed Finisher2_Tray to Finisher1_Tray to introduce some redundancy
		(Stackedin ?sheet Finisher1_Tray)
		(not (Location ?sheet Finisher2_Entry-Finisher1_Exit))
		(Available Finisher2-RSRC)
		(increase (total-cost) 7999))
)
(:action ColorFeeder-Feed-Letter
 :parameters ( ?sheet - sheet_t)
 :precondition (and
		(Available ColorFeeder-RSRC)
		(Sheetsize ?sheet Letter)
		(Location ?sheet Some_Feeder_Tray))
 :effect (and
		(Location ?sheet Down_BottomEntry-ColorFeeder_Exit)
		(Sideup ?sheet Front)
		(not (Location ?sheet Some_Feeder_Tray))
		(Available ColorFeeder-RSRC)
		(increase (total-cost) 7999))
)
)

; problem
(define (problem PrintJob)
(:domain upp)
(:objects
		dummy-sheet
		sheet1
		sheet2
		sheet3
		sheet4
		sheet5
		sheet6
		sheet7
		sheet8
		sheet9
		sheet10 - sheet_t
		image-1
		image-2
		image-3
		image-4
		image-5
		image-6
		image-7
		image-8
		image-9
		image-10 - image_t
)
(:INIT 
(available blackcontainer-rsrc)
(available blackfeeder-rsrc)
(available blackprinter-rsrc)
(available colorcontainer-rsrc)
(available colorfeeder-rsrc)
(available colorprinter-rsrc)
(available down-rsrc)
(available endcap-rsrc)
(available finisher1-rsrc)
(available finisher2-rsrc)
(available htmoverblack-rsrc)
(available htmovercolor-rsrc)
(available up-rsrc)
(hasimage sheet1 front image-1)
(hasimage sheet2 front image-2)
(imagecolor image-1 color) 
(imagecolor image-10 black) 
(imagecolor image-2 color) 
(imagecolor image-3 color) 
(imagecolor image-4 color) 
(imagecolor image-5 color) 
(imagecolor image-6 black) 
(imagecolor image-7 color) 
(imagecolor image-8 color) 
(imagecolor image-9 color) 
(location dummy-sheet some_finisher_tray)
(location sheet1 some_finisher_tray)
(location sheet10 some_feeder_tray)
(location sheet2 some_finisher_tray)
(location sheet3 some_feeder_tray)
(location sheet4 some_feeder_tray)
(location sheet5 some_feeder_tray)
(location sheet6 some_feeder_tray)
(location sheet7 some_feeder_tray)
(location sheet8 some_feeder_tray)
(location sheet9 some_feeder_tray)
(notprintedwith sheet1 back black)
(notprintedwith sheet1 back color)
(notprintedwith sheet1 front black)
(notprintedwith sheet10 back black)
(notprintedwith sheet10 back color)
(notprintedwith sheet10 front black)
(notprintedwith sheet10 front color)
(notprintedwith sheet2 back black)
(notprintedwith sheet2 back color)
(notprintedwith sheet2 front black)
(notprintedwith sheet3 back black)
(notprintedwith sheet3 back color)
(notprintedwith sheet3 front black)
(notprintedwith sheet3 front color)
(notprintedwith sheet4 back black)
(notprintedwith sheet4 back color)
(notprintedwith sheet4 front black)
(notprintedwith sheet4 front color)
(notprintedwith sheet5 back black)
(notprintedwith sheet5 back color)
(notprintedwith sheet5 front black)
(notprintedwith sheet5 front color)
(notprintedwith sheet6 back black)
(notprintedwith sheet6 back color)
(notprintedwith sheet6 front black)
(notprintedwith sheet6 front color)
(notprintedwith sheet7 back black)
(notprintedwith sheet7 back color)
(notprintedwith sheet7 front black)
(notprintedwith sheet7 front color)
(notprintedwith sheet8 back black)
(notprintedwith sheet8 back color)
(notprintedwith sheet8 front black)
(notprintedwith sheet8 front color)
(notprintedwith sheet9 back black)
(notprintedwith sheet9 back color)
(notprintedwith sheet9 front black)
(notprintedwith sheet9 front color)
(oppositeside back front) 
(oppositeside front back) 
(prevsheet sheet1 dummy-sheet) 
(prevsheet sheet10 sheet9) 
(prevsheet sheet2 sheet1) 
(prevsheet sheet3 sheet2) 
(prevsheet sheet4 sheet3) 
(prevsheet sheet5 sheet4) 
(prevsheet sheet6 sheet5) 
(prevsheet sheet7 sheet6) 
(prevsheet sheet8 sheet7) 
(prevsheet sheet9 sheet8) 
(sheetsize sheet1 letter) 
(sheetsize sheet10 letter) 
(sheetsize sheet2 letter) 
(sheetsize sheet3 letter) 
(sheetsize sheet4 letter) 
(sheetsize sheet5 letter) 
(sheetsize sheet6 letter) 
(sheetsize sheet7 letter) 
(sheetsize sheet8 letter) 
(sheetsize sheet9 letter) 
(sideup sheet1 front)
(sideup sheet2 front)
(stackedin sheet1 finisher1_tray)
(stackedin sheet2 finisher1_tray)
)
(:goal (and
		(Hasimage sheet3 Front image-3)
		(Notprintedwith sheet3 Front Black)
		(Notprintedwith sheet3 Back Black)
		(Notprintedwith sheet3 Back Color)
(Sideup sheet3 Front)
		(Stackedin sheet3 Finisher1_Tray)
		
))
)

; plan
1. (colorfeeder-feed-letter sheet3)
   deleted: (location sheet3 some_feeder_tray)
   added: (location sheet3 down_bottomentry-colorfeeder_exit) (sideup sheet3 front)
   goals met: 4 of 6
2. (down-movebottom-letter sheet3)
   deleted: (location sheet3 down_bottomentry-colorfeeder_exit)
   added: (location sheet3 colorcontainer_entry-down_bottomexit)
   goals met: 4 of 6
3. (colorcontainer-toime-letter sheet3)
   deleted: (location sheet3 colorcontainer_entry-down_bottomexit)
   added: (location sheet3 colorcontainer_exittoime-colorprinter_entry)
   goals met: 4 of 6
4. (colorprinter-simplex-letter sheet3 front image-3)
   deleted: (location sheet3 colorcontainer_exittoime-colorprinter_entry) (notprintedwith sheet3 front color)
   added: (location sheet3 colorprinter_exit-colorcontainer_entryfromime) (hasimage sheet3 front image-3)
   goals met: 5 of 6
5. (colorcontainer-fromime-letter sheet3)
   deleted: (location sheet3 colorprinter_exit-colorcontainer_entryfromime)
   added: (location sheet3 colorcontainer_exit-up_bottomentry)
   goals met: 5 of 6
6. (up-moveup-letter sheet3)
   deleted: (location sheet3 colorcontainer_exit-up_bottomentry)
   added: (location sheet3 finisher1_entry-up_topexit)
   goals met: 5 of 6
7. (finisher1-stack-letter sheet3 sheet2)
   deleted: (location sheet3 finisher1_entry-up_topexit)
   added: (location sheet3 some_finisher_tray) (stackedin sheet3 finisher1_tray)
   goals met: 6 of 6
